src/cf/src/Documents/КоммерческоеПредложение/КоммерческоеПредложение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КоммерческоеПредложение</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКоммерческихПредложений</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <comment>Номер последней отправленной клиенту редакции; 0 - ещё не отправлялось. Пересчитывается из регистра редакций при каждой записи</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененоПослеРедакции</name>
    <comment>Содержимое отличается от последней отправленной редакции (черновик правок)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/InformationRegisters/РедакцииКоммерческихПредложений/РедакцииКоммерческихПредложений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РедакцииКоммерческихПредложений</name>
  <comment>Снимки отправленных клиенту редакций коммерческого предложения: данные для возврата редакции и самодостаточные данные печати</comment>
  <resources>
    <name>Данные</name>
    <comment>Снимок: Структура «Объект» (шапка и товары) и «Печать» (данные печати на момент фиксации)</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Хеш</name>
    <comment>SHA-256 содержимого «Объект»: по нему решается, изменилось ли предложение</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <comment>Момент фиксации редакции</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <comment>Пользователь, записавший редакцию</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <comment>Сумма предложения в редакции - для списка редакций</comment>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <comment>Валюта суммы редакции</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <dimensions>
    <name>Предложение</name>
    <comment>Предложение, чья это редакция; ведущее - записи удаляются вместе с документом</comment>
    <type>
      <types>DocumentRef.КоммерческоеПредложение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Версия</name>
    <comment>Номер редакции, с 1</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Enums/СтатусыКоммерческихПредложений/СтатусыКоммерческихПредложений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКоммерческихПредложений</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Проигран</name>
  </enumValues>
  <enumValues>
    <name>Выигран</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>CLIENT_DE_PASSAGE</name>
      <description>CLIENT DE PASSAGE</description>
    </items>
    <items>
      <name>Migration</name>
      <description>Migration</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьКПрефиксуМесяцОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NIF</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Субподрядчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретОтгрузок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольКредита</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКредита</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчётаОтсрочки</name>
    <type>
      <types>EnumRef.СпособыРасчётаОтсрочки</types>
    </type>
  </attributes>
  <attributes>
    <name>ICE</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>СвояКомпания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодДеятельности</name>
    <type>
      <types>CatalogRef.РодыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>CatalogRef.УсловияОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьНакладнойЦеныБезНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛичныйКабинетПартнера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧГрафикДоставок</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоставкиС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоставкиПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийЛогиста</name>
      <type>
        <types>DefinedType.КомментарийКороткий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Documents/КоммерческоеПредложение/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Описание новой строки предложения по умолчанию: описание из карточки номенклатуры, если оно выводится на печать.
// Дальше у каждой строки описание своё и в карточку не переносится.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - номенклатура строки.
//
// Возвращаемое значение:
//  Строка - описание строки, пустая строка, если в карточке описания для печати нет.
//
Функция ОписаниеСтрокиПоУмолчанию(Номенклатура) Экспорт
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат "";
	КонецЕсли;
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "Описание, ВыводитьНаПечатьОписание");
	Возврат ?(Реквизиты.ВыводитьНаПечатьОписание = Истина, Реквизиты.Описание, "");
КонецФункции

// Признак статуса «отправлено клиенту»: с него начинается учёт редакций предложения
// (docs/plans/kp-print-revisions.md).
//
// Параметры:
//  Статус - ПеречислениеСсылка.СтатусыКоммерческихПредложений - статус предложения.
//
// Возвращаемое значение:
//  Булево - Истина для статусов Отправлен, Доставлен, Выигран, Проигран.
//
Функция СтатусОтправлен(Статус) Экспорт
	Возврат ЗначениеЗаполнено(Статус) И Статус <> Перечисления.СтатусыКоммерческихПредложений.Черновик;
КонецФункции

// Перечисляет печатные формы коммерческого предложения.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - пополняемая коллекция команд печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = ИмяМакетаПечати();
	Команда.Представление = НСтр("ru = 'Коммерческое предложение'; fr = 'Devis';
		|en = 'Quotation'; es = 'Presupuesto'");
КонецПроцедуры

// Формирует печатную форму коммерческого предложения. Источник данных - один на номер редакции:
// отправленная редакция без правок и редакция, выбранная явно (ПараметрыПечати.Версия), печатаются из
// снимка регистра редакций, не обращаясь к справочникам; не отправлявшееся предложение и черновик правок -
// по данным документа.
//
// Параметры:
//  МассивОбъектов        - Массив - ссылки на коммерческие предложения.
//  ПараметрыПечати       - Структура - параметры команды печати; ключ Версия - номер печатаемой редакции.
//  КоллекцияПечатныхФорм - ТаблицаЗначений - коллекция печатных форм.
//  ОбъектыПечати         - СписокЗначений - соответствие документов областям печати.
//  ПараметрыВывода       - Структура - параметры окна печати.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если Не ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакетаПечати()) Тогда
		Возврат;
	КонецЕсли;
	ЯвнаяВерсия = Неопределено;
	Если ТипЗнч(ПараметрыПечати) = Тип("Структура") Тогда
		ПараметрыПечати.Свойство("Версия", ЯвнаяВерсия);
	КонецЕсли;

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.РазмерСтраницы = "A4";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ПолеСлева = 12;
	ТабличныйДокумент.ПолеСправа = 12;
	ТабличныйДокумент.ПолеСверху = 10;
	ТабличныйДокумент.ПолеСнизу = 10;

	// Тексты, которые модуль собирает сам, - на языке, выбранном в окне печати, а не на языке сеанса.
	КодЯзыка = ПечатныеФормы.ЯзыкПечати();
	ИмяФайла = "";
	Для Каждого Документ Из МассивОбъектов Цикл
		Источник = ИсточникПечати(Документ, ЯвнаяВерсия, КодЯзыка);
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		НачальнаяСтрока = ТабличныйДокумент.ВысотаТаблицы + 1;
		ВывестиПредложение(ТабличныйДокумент, Источник.Данные, Источник.Плашка, КодЯзыка);
		ПечатныеФормы.ЗадатьОбластьПечати(ТабличныйДокумент, НачальнаяСтрока, ОбъектыПечати, Документ);
		ИмяФайла = Источник.ИмяФайла;
	КонецЦикла;
	Если МассивОбъектов.Количество() = 1 Тогда
		ТабличныйДокумент.ИспользуемоеИмяФайла = ИмяФайла;
	КонецЕсли;

	ПутьМакета = "Документ.КоммерческоеПредложение." + ИмяМакетаПечати();
	Представление = НСтр("ru = 'Коммерческое предложение'; fr = 'Devis'; en = 'Quotation'; es = 'Presupuesto'",
		КодЯзыка);
	ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, ИмяМакетаПечати(),
		Представление, ТабличныйДокумент, ПутьМакета);
КонецПроцедуры

// Редакции предложения для списка выбора в форме: от последней к первой.
//
// Параметры:
//  Предложение - ДокументСсылка.КоммерческоеПредложение - предложение.
//
// Возвращаемое значение:
//  Массив из Структура - Версия (Число), Дата (Дата), Автор (СправочникСсылка.Пользователи),
//                        Сумма (Число), Валюта (СправочникСсылка.Валюты); пустой, если редакций нет.
//
Функция СписокРедакций(Предложение) Экспорт
	Результат = Новый Массив;
	Если Не ЗначениеЗаполнено(Предложение) Тогда
		Возврат Результат;
	КонецЕсли;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Редакции.Версия КАК Версия,
	|	Редакции.Дата КАК Дата,
	|	Редакции.Автор КАК Автор,
	|	Редакции.Сумма КАК Сумма,
	|	Редакции.Валюта КАК Валюта
	|ИЗ
	|	РегистрСведений.РедакцииКоммерческихПредложений КАК Редакции
	|ГДЕ
	|	Редакции.Предложение = &Предложение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Версия УБЫВ");
	Запрос.УстановитьПараметр("Предложение", Предложение);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Редакция = Новый Структура("Версия, Дата, Автор, Сумма, Валюта");
		ЗаполнитьЗначенияСвойств(Редакция, Выборка);
		Результат.Добавить(Редакция);
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Снимок редакции предложения из регистра редакций.
//
// Параметры:
//  Предложение - ДокументСсылка.КоммерческоеПредложение - предложение.
//  Версия      - Число - номер редакции.
//
// Возвращаемое значение:
//  Структура, Неопределено - Объект (Структура: Шапка, Товары) и Печать (данные печати, см. ДанныеДляПечати);
//                            Неопределено, если такой редакции нет.
//
Функция ДанныеРедакции(Предложение, Версия) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Редакции.Данные КАК Данные
	|ИЗ
	|	РегистрСведений.РедакцииКоммерческихПредложений КАК Редакции
	|ГДЕ
	|	Редакции.Предложение = &Предложение
	|	И Редакции.Версия = &Версия");
	Запрос.УстановитьПараметр("Предложение", Предложение);
	Запрос.УстановитьПараметр("Версия", Версия);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Данные = Выборка.Данные.Получить();
	Возврат ?(ТипЗнч(Данные) = Тип("Структура"), Данные, Неопределено);
КонецФункции

// Содержимое редакции для возврата в текущее предложение: ссылки снимка, которых уже нет в базе,
// заменены пустыми значениями и перечислены в НеНайдено (ссылки внутри хранилища значения
// ссылочной целостностью не защищены).
//
// Параметры:
//  Предложение - ДокументСсылка.КоммерческоеПредложение - предложение.
//  Версия      - Число - номер редакции.
//
// Возвращаемое значение:
//  Структура, Неопределено - Шапка (Структура), Товары (ТаблицаЗначений), НеНайдено (Массив из Строка);
//                            Неопределено, если такой редакции нет.
//
Функция СодержимоеДляВозврата(Предложение, Версия) Экспорт
	Снимок = ДанныеРедакции(Предложение, Версия);
	Если Снимок = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Шапка = Снимок.Объект.Шапка;
	Товары = Снимок.Объект.Товары;
	НеНайдено = Новый Массив;

	Ссылки = Новый Массив;
	Для Каждого КлючИЗначение Из Шапка Цикл
		ДобавитьСсылку(Ссылки, КлючИЗначение.Значение);
	КонецЦикла;
	Для Каждого СтрокаТоваров Из Товары Цикл
		Для Каждого Колонка Из Товары.Колонки Цикл
			ДобавитьСсылку(Ссылки, СтрокаТоваров[Колонка.Имя]);
		КонецЦикла;
	КонецЦикла;
	Существующие = СуществующиеСсылки(Ссылки);

	Для Каждого КлючИЗначение Из Шапка Цикл
		Если ЭтоОтсутствующаяСсылка(КлючИЗначение.Значение, Существующие) Тогда
			НеНайдено.Добавить(СтрШаблон("%1: %2", КлючИЗначение.Ключ, Строка(КлючИЗначение.Значение)));
			Шапка[КлючИЗначение.Ключ] = ПустоеЗначение(КлючИЗначение.Значение);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаТоваров Из Товары Цикл
		Для Каждого Колонка Из Товары.Колонки Цикл
			Значение = СтрокаТоваров[Колонка.Имя];
			Если ЭтоОтсутствующаяСсылка(Значение, Существующие) Тогда
				ШаблонСтроки = НСтр("ru = 'строка %1, %2: %3'; fr = 'ligne %1, %2 : %3';
					|en = 'line %1, %2: %3'; es = 'línea %1, %2: %3'");
				ПредставлениеЗначения = Строка(Значение);
				НеНайдено.Добавить(СтрШаблон(ШаблонСтроки, СтрокаТоваров.НомерСтроки, Колонка.Имя, ПредставлениеЗначения));
				СтрокаТоваров[Колонка.Имя] = ПустоеЗначение(Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат Новый Структура("Шапка, Товары, НеНайдено", Шапка, Товары, НеНайдено);
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Реквизиты шапки, из которых состоит редакция: они попадают в снимок, в хеш и возвращаются
// вместе с редакцией (кроме Номер - у предложения контроль уникальности номера). Ответственный печатается
// вместо незаполненного менеджера, поэтому тоже входит в редакцию.
//
// Возвращаемое значение:
//  Строка - имена реквизитов через запятую.
//
Функция РеквизитыШапкиРедакции() Экспорт
	Возврат "Номер, Дата, Организация, Контрагент, Договор, Менеджер, Ответственный, ДатаОтгрузки, ЦенаВключаетНДС, "
		+ "ВВалюте, Валюта, КурсВалюты, Комментарий";
КонецФункции

// Содержимое предложения для снимка редакции и для хеша: шапка и строки товаров в фиксированном порядке.
//
// Параметры:
//  Объект - ДокументОбъект.КоммерческоеПредложение - предложение (в том числе ещё не записанное).
//
// Возвращаемое значение:
//  Структура - Шапка (Структура реквизитов РеквизитыШапкиРедакции), Товары (ТаблицаЗначений колонок ТЧТовары).
//
Функция СодержимоеРедакции(Объект) Экспорт
	Шапка = Новый Структура(РеквизитыШапкиРедакции());
	ЗаполнитьЗначенияСвойств(Шапка, Объект);
	Колонки = ИменаКолонокТоваров();
	Товары = Объект.ТЧТовары.Выгрузить(, "НомерСтроки," + Колонки);
	Возврат Новый Структура("Шапка, Товары", Шапка, Товары);
КонецФункции

// SHA-256 содержимого предложения. Считается по значениям в фиксированном порядке реквизитов и колонок,
// поэтому не зависит от порядка ключей структуры и типов колонок таблицы.
//
// Параметры:
//  Содержимое - Структура - см. СодержимоеРедакции.
//
// Возвращаемое значение:
//  Строка - хеш в шестнадцатеричном виде, 64 символа.
//
Функция ХешСодержимого(Содержимое) Экспорт
	Возврат ХешПоСоставу(Содержимое, Неопределено);
КонецФункции

// Хеш содержимого в составе шапки сохранённой редакции: редакция, записанная до расширения состава
// (2.0.16.51 - Ответственный), сравнивается по своим реквизитам, иначе запись без изменений дала бы новую редакцию.
//
// Параметры:
//  Содержимое  - Структура - см. СодержимоеРедакции.
//  Предложение - ДокументСсылка.КоммерческоеПредложение - предложение.
//  Версия      - Число - номер сохранённой редакции.
//
// Возвращаемое значение:
//  Строка - хеш; пусто, если редакции нет.
//
Функция ХешВСоставеРедакции(Содержимое, Предложение, Версия) Экспорт
	Снимок = ДанныеРедакции(Предложение, Версия);
	Если Снимок = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	СоставШапки = Снимок.Объект.Шапка;
	// Ответственного старый состав не хранил, но печатал вместо пустого менеджера: его смена сверяется с напечатанным.
	Если Не СоставШапки.Свойство("Ответственный") И Не ЗначениеЗаполнено(Содержимое.Шапка.Менеджер)
		И СокрЛП(Содержимое.Шапка.Ответственный) <> Снимок.Печать.Шапка.Менеджер Тогда
		Возврат "";
	КонецЕсли;
	Возврат ХешПоСоставу(Содержимое, СоставШапки);
КонецФункции

// Данные печати предложения на текущий момент: все представления - строками, картинки организации -
// двоичными данными. Этой же структурой печатается снимок редакции, поэтому она самодостаточна и
// справочники при перепечатке не читаются.
//
// Параметры:
//  Объект - ДокументОбъект.КоммерческоеПредложение - предложение (в том числе ещё не записанное).
//
// Возвращаемое значение:
//  Структура - Организация, Клиент, Шапка, Товары (Массив из Структура), Итоги, Логотип, ПечатьОрганизации.
//
Функция ДанныеДляПечати(Объект) Экспорт
	Дата = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
	КарточкаОрганизации = Справочники.Контрагенты.ПолучитьКарточку(Объект.Организация, Дата);
	КарточкаКлиента = Справочники.Контрагенты.ПолучитьКарточку(Объект.Контрагент, Дата);
	ВалютаДокумента = РаботаСВалютами.ВалютаИКурсДокумента(Объект).Валюта;
	КодВалюты = СокрЛП(ВалютаДокумента);

	Данные = Новый Структура;
	// 2 - договор клиента без подписи и сумма прописью на каждом языке: снимок печатается на любом языке.
	Данные.Вставить("ВерсияФормата", 2);
	Данные.Вставить("КодВалюты", КодВалюты);

	Организация = Новый Структура;
	Организация.Вставить("ОрганизацияНаименование", НаименованиеИзКарточки(КарточкаОрганизации));
	Организация.Вставить("ОрганизацияАдрес", СокрЛП(КарточкаОрганизации.АдресЮридический));
	Контакты = СокрЛП(КарточкаОрганизации.Телефоны);
	ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Контакты, РеквизитКарточки(КарточкаОрганизации, "EMail"), " · ");
	ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Контакты, РеквизитКарточки(КарточкаОрганизации, "Web"), " · ");
	Организация.Вставить("ОрганизацияКонтакты", Контакты);
	Коды = "";
	ДобавитьКод(Коды, КодICE(), РеквизитКарточки(КарточкаОрганизации, КодICE()));
	ДобавитьКод(Коды, "RC", РеквизитКарточки(КарточкаОрганизации, "RC"));
	ДобавитьКод(Коды, "IF", РеквизитКарточки(КарточкаОрганизации, "NIF"));
	Организация.Вставить("ОрганизацияКоды", Коды);
	Организация.Вставить("ПодвалРеквизитов",
		ПечатныеФормы.РеквизитыОрганизацииДляПодвала(Объект.Организация, Дата, КарточкаОрганизации));
	Данные.Вставить("Организация", Организация);

	Клиент = Новый Структура;
	Клиент.Вставить("КлиентНаименование", НаименованиеИзКарточки(КарточкаКлиента));
	РеквизитыКлиента = СокрЛП(КарточкаКлиента.АдресЮридический);
	ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(РеквизитыКлиента, СокрЛП(КарточкаКлиента.Телефоны), Символы.ПС);
	КодыКлиента = "";
	ДобавитьКод(КодыКлиента, КодICE(), РеквизитКарточки(КарточкаКлиента, КодICE()));
	ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(РеквизитыКлиента, КодыКлиента, Символы.ПС);
	Клиент.Вставить("КлиентРеквизиты", РеквизитыКлиента);
	// Подпись «Договор:» добавляет вывод на языке печати (см. РеквизитыКлиентаДляПечати).
	Клиент.Вставить("КлиентДоговор", ?(ЗначениеЗаполнено(Объект.Договор), СокрЛП(Объект.Договор), ""));
	Данные.Вставить("Клиент", Клиент);

	Шапка = Новый Структура;
	Шапка.Вставить("Номер", РаботаСДокументами.СформироватьЦифровойНомер(Объект.Номер));
	Шапка.Вставить("Дата", Объект.Дата);
	Шапка.Вставить("ДатаОтгрузки", Объект.ДатаОтгрузки);
	Шапка.Вставить("ЦенаВключаетНДС", Объект.ЦенаВключаетНДС);
	Менеджер = ?(ЗначениеЗаполнено(Объект.Менеджер), СокрЛП(Объект.Менеджер), СокрЛП(Объект.Ответственный));
	Шапка.Вставить("Менеджер", Менеджер);
	Шапка.Вставить("Комментарий", СокрЛП(Объект.Комментарий));
	Данные.Вставить("Шапка", Шапка);

	Данные.Вставить("Товары", СтрокиДляПечати(Объект));

	Итоги = Новый Структура;
	Итоги.Вставить("Сумма", Объект.Сумма);
	Итоги.Вставить("СуммаНДС", Объект.СуммаНДС);
	Итоги.Вставить("СуммаБезНДС", Объект.СуммаБезНДС);
	Итоги.Вставить("СуммаПрописью", ПечатныеФормы.СуммаПрописью(Объект.Сумма, ВалютаДокумента));
	// Снимок не обращается к справочнику валют при печати, поэтому сумма прописью хранится на всех языках.
	СуммаПрописьюПоЯзыкам = Новый Соответствие;
	Для Каждого Язык Из Метаданные.Языки Цикл
		СуммаПрописьюПоЯзыкам.Вставить(Язык.КодЯзыка,
			ПечатныеФормы.СуммаПрописью(Объект.Сумма, ВалютаДокумента, Язык.КодЯзыка));
	КонецЦикла;
	Итоги.Вставить("СуммаПрописьюПоЯзыкам", СуммаПрописьюПоЯзыкам);
	Данные.Вставить("Итоги", Итоги);

	Картинки = ПечатныеФормы.КартинкиОрганизации(Объект.Организация);
	Данные.Вставить("Логотип", Картинки.Логотип);
	Данные.Вставить("ПечатьОрганизации", Картинки.ПечатьОрганизации);
	Возврат Данные;
КонецФункции

// Снимок редакции для записи в регистр редакций.
//
// Параметры:
//  Объект - ДокументОбъект.КоммерческоеПредложение - предложение.
//
// Возвращаемое значение:
//  Структура - Объект (см. СодержимоеРедакции) и Печать (см. ДанныеДляПечати).
//
Функция СнимокРедакции(Объект) Экспорт
	Возврат Новый Структура("Объект, Печать", СодержимоеРедакции(Объект), ДанныеДляПечати(Объект));
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ХешПоСоставу(Содержимое, СоставШапки)
	Значения = Новый Массив;
	Для Каждого Имя Из СтрРазделить(РеквизитыШапкиРедакции(), ", ", Ложь) Цикл
		Если СоставШапки <> Неопределено И Не СоставШапки.Свойство(Имя) Тогда
			Продолжить;
		КонецЕсли;
		Значения.Добавить(Содержимое.Шапка[Имя]);
	КонецЦикла;
	Колонки = СтрРазделить(ИменаКолонокТоваров(), ",", Ложь);
	Для Каждого СтрокаТоваров Из Содержимое.Товары Цикл
		Для Каждого Имя Из Колонки Цикл
			Значения.Добавить(СтрокаТоваров[Имя]);
		КонецЦикла;
	КонецЦикла;
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеширование.Добавить(ЗначениеВСтрокуВнутр(Значения));
	Возврат НРег(ПолучитьHexСтрокуИзДвоичныхДанных(Хеширование.ХешСумма));
КонецФункции

Функция ИмяМакетаПечати()
	Возврат "КоммерческоеПредложение";
КонецФункции

Функция ИменаКолонокТоваров()
	Имена = Новый Массив;
	Для Каждого Реквизит Из Метаданные.Документы.КоммерческоеПредложение.ТабличныеЧасти.ТЧТовары.Реквизиты Цикл
		Имена.Добавить(Реквизит.Имя);
	КонецЦикла;
	Возврат СтрСоединить(Имена, ",");
КонецФункции

Функция ИсточникПечати(Документ, ЯвнаяВерсия, КодЯзыка)
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Номер, Версия, ИзмененоПослеРедакции");
	Номер = РаботаСДокументами.СформироватьЦифровойНомер(Реквизиты.Номер);
	Версия = Реквизиты.Версия;
	Источник = Новый Структура("Данные, Плашка, ИмяФайла");
	ИзСнимка = ЗначениеЗаполнено(ЯвнаяВерсия) Или (Версия > 0 И Не Реквизиты.ИзмененоПослеРедакции);
	Если ИзСнимка Тогда
		ПечатаемаяВерсия = ?(ЗначениеЗаполнено(ЯвнаяВерсия), ЯвнаяВерсия, Версия);
		Снимок = ДанныеРедакции(Документ, ПечатаемаяВерсия);
		Если Снимок <> Неопределено Тогда
			Источник.Данные = Снимок.Печать;
			Источник.Плашка = ПлашкаРедакции(ПечатаемаяВерсия, Ложь, КодЯзыка);
			Источник.ИмяФайла = ИмяФайлаПечати(Номер, ПечатаемаяВерсия, КодЯзыка);
			Возврат Источник;
		КонецЕсли;
	КонецЕсли;
	Источник.Данные = ДанныеДляПечати(Документ.ПолучитьОбъект());
	Если Реквизиты.ИзмененоПослеРедакции Тогда
		Источник.Плашка = ПлашкаРедакции(Версия + 1, Истина, КодЯзыка);
		Источник.ИмяФайла = ИмяФайлаПечати(Номер, Версия + 1, КодЯзыка);
	Иначе
		Источник.Плашка = "";
		Источник.ИмяФайла = ИмяФайлаПечати(Номер, 0, КодЯзыка);
	КонецЕсли;
	Возврат Источник;
КонецФункции

Функция ПлашкаРедакции(Версия, Черновик, КодЯзыка)
	НомерВерсии = Формат(Версия, "ЧГ=0");
	Если Черновик Тогда
		Шаблон = НСтр("ru = 'Редакция v%1 · черновик'; fr = 'Révision v%1 · brouillon';
			|en = 'Revision v%1 · draft'; es = 'Revisión v%1 · borrador'", КодЯзыка);
	Иначе
		Шаблон = НСтр("ru = 'Редакция v%1'; fr = 'Révision v%1'; en = 'Revision v%1'; es = 'Revisión v%1'", КодЯзыка);
	КонецЕсли;
	Возврат СтрШаблон(Шаблон, НомерВерсии);
КонецФункции

Функция ИмяФайлаПечати(Номер, Версия, КодЯзыка)
	ИмяФайла = НСтр("ru = 'КП'; fr = 'Devis'; en = 'Quotation'; es = 'Presupuesto'", КодЯзыка) + " " + Номер;
	Если Версия > 0 Тогда
		ИмяФайла = ИмяФайла + " v" + Формат(Версия, "ЧГ=0");
	КонецЕсли;
	Возврат ИмяФайла;
КонецФункции

Процедура ВывестиПредложение(ТабличныйДокумент, Данные, Плашка, КодЯзыка)
	Макет = ПечатныеФормы.МакетПечатнойФормы("Документ.КоммерческоеПредложение." + ИмяМакетаПечати());
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьСтороны = Макет.ПолучитьОбласть("Стороны");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьОписание = Макет.ПолучитьОбласть("ОписаниеСтроки");
	ОбластьРазделитель = Макет.ПолучитьОбласть("РазделительСтрок");
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	ОбластьУсловия = Макет.ПолучитьОбласть("Условия");
	ОбластьПодпись = Макет.ПолучитьОбласть("Подпись");
	ОбластьПодвал = Макет.ПолучитьОбласть("ПодвалРеквизитов");
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");

	Шапка = Данные.Шапка;
	КодВалюты = Данные.КодВалюты;
	Картинки = Новый Соответствие;
	Картинки.Вставить("ЛоготипПредложения", Данные.Логотип);
	Картинки.Вставить("ПечатьПредложения", Данные.ПечатьОрганизации);

	ОбластьШапка.Параметры.Заполнить(Данные.Организация);
	ПечатныеФормы.ЗаполнитьРисункиКартинками(ОбластьШапка, Картинки);
	ОбластьПодвал.Параметры.ПодвалРеквизитов = Данные.Организация.ПодвалРеквизитов;
	ОбластьЗаголовок.Параметры.Номер = Шапка.Номер;
	ОбластьЗаголовок.Параметры.Дата = ФорматДаты(Шапка.Дата, КодЯзыка);
	ОбластьЗаголовок.Параметры.ПлашкаРедакции = Плашка;
	ОбластьСтороны.Параметры.Заполнить(Данные.Клиент);
	ОбластьСтороны.Параметры.КлиентРеквизиты = РеквизитыКлиентаДляПечати(Данные.Клиент, КодЯзыка);
	ОбластьСтороны.Параметры.Менеджер = Шапка.Менеджер;
	ОбластьСтороны.Параметры.УсловияКратко = УсловияКратко(Шапка, КодЯзыка);

	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	ТабличныйДокумент.Вывести(ОбластьСтороны);
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);

	ВнизуСтраницы = Новый Массив;
	ВнизуСтраницы.Добавить(ОбластьПодвал);
	Для Каждого Товар Из Данные.Товары Цикл
		ОбластьСтрока.Параметры.НомерСтроки = Товар.НомерСтроки;
		ОбластьСтрока.Параметры.Наименование = Товар.Наименование;
		ОбластьСтрока.Параметры.Количество = ФорматКоличества(Товар.Количество, КодЯзыка);
		ОбластьСтрока.Параметры.Единица = Товар.Единица;
		ОбластьСтрока.Параметры.Цена = ФорматДенег(Товар.Цена, КодЯзыка);
		ФорматСкидки = "ЧДЦ=2; " + ПечатныеФормы.ЛокализацияФормата(КодЯзыка);
		ОбластьСтрока.Параметры.Скидка = ?(Товар.ПроцентСкидки = 0, "", Формат(Товар.ПроцентСкидки, ФорматСкидки) + " %");
		ОбластьСтрока.Параметры.Сумма = ФорматДенег(Товар.Сумма, КодЯзыка);
		ОбластиСтроки = Новый Массив;
		ОбластиСтроки.Добавить(ОбластьСтрока);
		ЕстьОписание = ЗначениеЗаполнено(Товар.Описание);
		Если ЕстьОписание Тогда
			ОбластьОписание.Параметры.Описание = Товар.Описание;
			ОбластиСтроки.Добавить(ОбластьОписание);
		КонецЕсли;
		ОбластиСтроки.Добавить(ОбластьРазделитель);
		ОбластиСтроки.Добавить(ОбластьПодвал);
		Если Не ТабличныйДокумент.ПроверитьВывод(ОбластиСтроки) Тогда
			НоваяСтраница(ТабличныйДокумент, ОбластьПустаяСтрока, ОбластьПодвал);
			ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		Если ЕстьОписание Тогда
			ТабличныйДокумент.Вывести(ОбластьОписание);
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьРазделитель);
	КонецЦикла;

	Итоги = Данные.Итоги;
	ОбластьИтоги.Параметры.СуммаБезНДС = ФорматДенег(Итоги.СуммаБезНДС, КодЯзыка) + " " + КодВалюты;
	ОбластьИтоги.Параметры.СуммаНДС = ФорматДенег(Итоги.СуммаНДС, КодЯзыка) + " " + КодВалюты;
	ОбластьИтоги.Параметры.Итого = ФорматДенег(Итоги.Сумма, КодЯзыка) + " " + КодВалюты;
	ОбластьИтоги.Параметры.СуммаПрописью = СуммаПрописьюНаЯзыке(Итоги, КодЯзыка);
	ВывестиБлок(ТабличныйДокумент, ОбластьИтоги, ОбластьПустаяСтрока, ОбластьПодвал);

	Если ЗначениеЗаполнено(Шапка.Комментарий) Тогда
		ОбластьУсловия.Параметры.Условия = Шапка.Комментарий;
		ВывестиБлок(ТабличныйДокумент, ОбластьУсловия, ОбластьПустаяСтрока, ОбластьПодвал);
	КонецЕсли;

	ОбластьПодпись.Параметры.ПодписьМенеджер = Шапка.Менеджер;
	ОбластьПодпись.Параметры.ПодписьОрганизация = Данные.Организация.ОрганизацияНаименование;
	ПечатныеФормы.ЗаполнитьРисункиКартинками(ОбластьПодпись, Картинки);
	ВывестиБлок(ТабличныйДокумент, ОбластьПодпись, ОбластьПустаяСтрока, ОбластьПодвал);

	ПечатныеФормы.ДобитьСтраницуПустымиСтроками(ТабличныйДокумент, ОбластьПустаяСтрока, ВнизуСтраницы);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
КонецПроцедуры

Процедура ВывестиБлок(ТабличныйДокумент, Область, ОбластьПустаяСтрока, ОбластьПодвал)
	Проверка = Новый Массив;
	Проверка.Добавить(Область);
	Проверка.Добавить(ОбластьПодвал);
	Если Не ТабличныйДокумент.ПроверитьВывод(Проверка) Тогда
		НоваяСтраница(ТабличныйДокумент, ОбластьПустаяСтрока, ОбластьПодвал);
	КонецЕсли;
	ТабличныйДокумент.Вывести(Область);
КонецПроцедуры

Процедура НоваяСтраница(ТабличныйДокумент, ОбластьПустаяСтрока, ОбластьПодвал)
	ВнизуСтраницы = Новый Массив;
	ВнизуСтраницы.Добавить(ОбластьПодвал);
	ПечатныеФормы.ДобитьСтраницуПустымиСтроками(ТабличныйДокумент, ОбластьПустаяСтрока, ВнизуСтраницы);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры

Функция УсловияКратко(Шапка, КодЯзыка)
	Текст = "";
	Если ЗначениеЗаполнено(Шапка.ДатаОтгрузки) Тогда
		Текст = НСтр("ru = 'Срок поставки: '; fr = 'Date de livraison : '; en = 'Delivery date: '; es = 'Fecha de entrega: '",
			КодЯзыка) + ФорматДаты(Шапка.ДатаОтгрузки, КодЯзыка);
	КонецЕсли;
	ВидЦен = ?(Шапка.ЦенаВключаетНДС, НСтр("ru = 'Цены указаны с НДС'; fr = 'Prix TTC'; en = 'Prices include VAT';
		|es = 'Precios con IVA'", КодЯзыка), НСтр("ru = 'Цены указаны без НДС'; fr = 'Prix HT'; en = 'Prices exclude VAT';
		|es = 'Precios sin IVA'", КодЯзыка));
	ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Текст, ВидЦен, Символы.ПС);
	Возврат Текст;
КонецФункции

// Реквизиты клиента с договором, подписанным на языке печати. В снимках формата 1 договор уже вписан
// в реквизиты на языке записи - они печатаются как есть.
//
// Параметры:
//  Клиент   - Структура - блок Клиент данных печати (см. ДанныеДляПечати).
//  КодЯзыка - Строка - язык печати.
//
// Возвращаемое значение:
//  Строка - реквизиты клиента для макета.
//
Функция РеквизитыКлиентаДляПечати(Клиент, КодЯзыка)
	Реквизиты = Клиент.КлиентРеквизиты;
	Договор = "";
	Если Клиент.Свойство("КлиентДоговор", Договор) И ЗначениеЗаполнено(Договор) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Реквизиты,
			НСтр("ru = 'Договор: '; fr = 'Contrat : '; en = 'Contract: '; es = 'Contrato: '", КодЯзыка) + Договор,
			Символы.ПС);
	КонецЕсли;
	Возврат Реквизиты;
КонецФункции

// Сумма прописью на языке печати. Снимки формата 1 хранят её только на языке записи.
//
// Параметры:
//  Итоги    - Структура - блок Итоги данных печати (см. ДанныеДляПечати).
//  КодЯзыка - Строка - язык печати.
//
// Возвращаемое значение:
//  Строка - сумма прописью.
//
Функция СуммаПрописьюНаЯзыке(Итоги, КодЯзыка)
	ПоЯзыкам = Неопределено;
	Если Итоги.Свойство("СуммаПрописьюПоЯзыкам", ПоЯзыкам) Тогда
		Текст = ПоЯзыкам.Получить(КодЯзыка);
		Если Текст <> Неопределено Тогда
			Возврат Текст;
		КонецЕсли;
	КонецЕсли;
	Возврат Итоги.СуммаПрописью;
КонецФункции

Функция ФорматДаты(Дата, КодЯзыка)
	Возврат Формат(Дата, "ДЛФ=D; " + ПечатныеФормы.ЛокализацияФормата(КодЯзыка));
КонецФункции

Функция СтрокиДляПечати(Объект)
	Товары = Объект.ТЧТовары.Выгрузить(, "НомерСтроки, Номенклатура, НоменклатураСтрока, Характеристика, Упаковка, "
		+ "КоличествоУпаковок, Цена, ПроцентСкидки, СуммаСНДС, СуммаНДС, Описание");
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Наименование КАК Наименование,
	|	Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	Номенклатура.Артикул КАК Артикул,
	|	ПРЕДСТАВЛЕНИЕ(Номенклатура.Единица) КАК Единица
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&Номенклатура)");
	Запрос.УстановитьПараметр("Номенклатура", Товары.ВыгрузитьКолонку("Номенклатура"));
	СведенияНоменклатуры = Запрос.Выполнить().Выгрузить();
	СведенияНоменклатуры.Индексы.Добавить("Ссылка");

	Строки = Новый Массив;
	Для Каждого Товар Из Товары Цикл
		Сведения = СведенияНоменклатуры.Найти(Товар.Номенклатура, "Ссылка");
		Наименование = НаименованиеСтроки(Товар, Сведения);
		Единица = ?(Сведения = Неопределено, "", Сведения.Единица);
		Если ЗначениеЗаполнено(Товар.Упаковка) Тогда
			Единица = СокрЛП(Товар.Упаковка);
		КонецЕсли;
		// Количество и цена - в упаковках строки: сумма строки = Цена × КоличествоУпаковок (РассчитатьСтроку).
		СтрокаПечати = Новый Структура;
		СтрокаПечати.Вставить("НомерСтроки", Товар.НомерСтроки);
		СтрокаПечати.Вставить("Наименование", Наименование);
		СтрокаПечати.Вставить("Описание", СокрЛП(Товар.Описание));
		СтрокаПечати.Вставить("Количество", Товар.КоличествоУпаковок);
		СтрокаПечати.Вставить("Единица", Единица);
		СтрокаПечати.Вставить("Цена", Товар.Цена);
		СтрокаПечати.Вставить("ПроцентСкидки", Товар.ПроцентСкидки);
		СтрокаПечати.Вставить("Сумма", ?(Объект.ЦенаВключаетНДС, Товар.СуммаСНДС, Товар.СуммаСНДС - Товар.СуммаНДС));
		Строки.Добавить(СтрокаПечати);
	КонецЦикла;
	Возврат Строки;
КонецФункции

Функция НаименованиеСтроки(Товар, Сведения)
	Наименование = СокрЛП(Товар.НоменклатураСтрока);
	Если Сведения <> Неопределено Тогда
		Если ПустаяСтрока(Наименование) Тогда
			Наименование = ?(ПустаяСтрока(Сведения.НаименованиеПолное), Сведения.Наименование, Сведения.НаименованиеПолное);
			Наименование = СокрЛП(Наименование);
		КонецЕсли;
		Артикул = СокрЛП(Сведения.Артикул);
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Наименование, Артикул, ", ");
	КонецЕсли;
	Если ЗначениеЗаполнено(Товар.Характеристика) Тогда
		Характеристика = СокрЛП(Товар.Характеристика);
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Наименование, Характеристика, ", ");
	КонецЕсли;
	Возврат Наименование;
КонецФункции

Функция НаименованиеИзКарточки(Карточка)
	Возврат СокрЛП(?(ПустаяСтрока(Карточка.НаименованиеПолное), Карточка.Наименование, Карточка.НаименованиеПолное));
КонецФункции

Функция РеквизитКарточки(Карточка, Имя)
	Значение = Неопределено;
	Карточка.Реквизиты.Свойство(Имя, Значение);
	Возврат СокрЛП(Значение);
КонецФункции

Функция КодICE()
	Возврат "ICE";
КонецФункции

Процедура ДобавитьКод(Строка, Подпись, Значение)
	Если ЗначениеЗаполнено(Значение) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Строка, Подпись + " " + Значение, " · ");
	КонецЕсли;
КонецПроцедуры

Функция ФорматДенег(Сумма, КодЯзыка)
	Локализация = ПечатныеФормы.ЛокализацияФормата(КодЯзыка);
	// Ноль - с десятичным разделителем языка печати: «0,00» или «0.00».
	Ноль = СтрЗаменить(Формат(1, "ЧДЦ=2; " + Локализация), "1", "0");
	Возврат Формат(Сумма, "ЧДЦ=2; ЧН=" + Ноль + "; " + Локализация);
КонецФункции

Функция ФорматКоличества(Количество, КодЯзыка)
	ФорматнаяСтрока = ?(Количество = Цел(Количество), "ЧДЦ=0; ЧН=0", "ЧДЦ=3; ЧН=0");
	Возврат Формат(Количество, ФорматнаяСтрока + "; " + ПечатныеФормы.ЛокализацияФормата(КодЯзыка));
КонецФункции

Процедура ДобавитьСсылку(Ссылки, Значение)
	Если ЗначениеЗаполнено(Значение) И ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Значение))
		И Ссылки.Найти(Значение) = Неопределено Тогда
		Ссылки.Добавить(Значение);
	КонецЕсли;
КонецПроцедуры

Функция ПустоеЗначение(Значение)
	Типы = Новый Массив;
	Типы.Добавить(ТипЗнч(Значение));
	ОписаниеТипа = Новый ОписаниеТипов(Типы);
	Возврат ОписаниеТипа.ПривестиЗначение(Неопределено);
КонецФункции

Функция ЭтоОтсутствующаяСсылка(Значение, Существующие)
	Возврат ЗначениеЗаполнено(Значение) И ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Значение))
		И Существующие[Значение] = Неопределено;
КонецФункции

Функция СуществующиеСсылки(Ссылки)
	// Ссылки из списка, которые есть в базе: одним запросом на таблицу, а не обращением на ссылку.
	Результат = Новый Соответствие;
	ПоТаблицам = Новый Соответствие;
	Для Каждого Ссылка Из Ссылки Цикл
		ПолноеИмя = Ссылка.Метаданные().ПолноеИмя();
		Список = ПоТаблицам[ПолноеИмя];
		Если Список = Неопределено Тогда
			Список = Новый Массив;
			ПоТаблицам.Вставить(ПолноеИмя, Список);
		КонецЕсли;
		Список.Добавить(Ссылка);
	КонецЦикла;
	Для Каждого КлючИЗначение Из ПоТаблицам Цикл
		// Перечисления в базе не удаляются: значение снимка остаётся действительным.
		Если СтрНачинаетсяС(КлючИЗначение.Ключ, "Перечисление.") Тогда
			Найденные = КлючИЗначение.Значение;
		Иначе
			Найденные = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(КлючИЗначение.Значение, "Ссылка КАК Найдена");
		КонецЕсли;
		Для Каждого Найденная Из Найденные Цикл
			Результат.Вставить(?(ТипЗнч(Найденная) = Тип("КлючИЗначение"), Найденная.Ключ, Найденная), Истина);
		КонецЦикла;
	КонецЦикла;
	Возврат Результат;
КонецФункции

#КонецОбласти
